#+TITLE:
#+AUTHOR: 
#+EMAIL: 
#+KEYWORDS:
#+DESCRIPTION:
#+TAGS:
#+LANGUAGE: en
#+OPTIONS: toc:nil ':t H:5
#+STARTUP: hidestars overview
#+LaTeX_CLASS: scrartcl
#+LaTeX_CLASS_OPTIONS: [a4paper,11pt]
#+PANDOC_OPTIONS:

** handling the remaining years

First filtering step:
#+BEGIN_SRC sh :results silent
  export PYTHONIOENCODING=utf-8
  for year in $(seq 1987 2007); do
    ./check_wikidata.py theof_${year}.tsv wikidata_humans.tsv > theof_${year}_wd.tsv
  done
#+END_SRC
Now we have restricted the list to phrases which contain a source that
matches a Wikidata item with an "instance of" property of "human".

What's the distribution?
#+BEGIN_SRC sh
    echo "year all wdfiltered blfiltered"
    for year in $(seq 1987 2007); do
      echo $year \
           $(cat theof_${year}.tsv | wc -l) \
           $(cat theof_${year}_wd.tsv | wc -l) \
           $(cat theof_${year}_wd_bl.tsv | wc -l)
    done
#+END_SRC

#+RESULTS:
| year |   all | wdfiltered | blfiltered |
| 1987 | 56513 |       2520 |        104 |
| 1988 | 55129 |       2640 |         88 |
| 1989 | 55602 |       2454 |        112 |
| 1990 | 53310 |       2608 |        117 |
| 1991 | 45822 |       2114 |        123 |
| 1992 | 41714 |       2232 |        158 |
| 1993 | 40338 |       2074 |        168 |
| 1994 | 37285 |       1867 |        166 |
| 1995 | 41839 |       2227 |        168 |
| 1996 | 40238 |       1972 |        194 |
| 1997 | 42737 |       2189 |        181 |
| 1998 | 46487 |       2654 |        268 |
| 1999 | 47431 |       2556 |        196 |
| 2000 | 44634 |       2165 |        233 |
| 2001 | 43209 |       2029 |        216 |
| 2002 | 44322 |       2236 |        223 |
| 2003 | 42874 |       2120 |        223 |
| 2004 | 41740 |       1943 |        205 |
| 2005 | 40774 |       2006 |        224 |
| 2006 | 40590 |       2071 |        231 |
| 2007 | 19004 |       1081 |        122 |

Filtering by blacklist:
#+BEGIN_SRC sh
  export PYTHONIOENCODING=utf-8
  for year in $(seq 1987 2007); do
    ./check_wikidata.py -b blacklist.tsv theof_${year}.tsv wikidata_humans.tsv > theof_${year}_wd_bl.tsv
  done
#+END_SRC

Extracting the blacklist:
#+BEGIN_SRC sh :results silent
    # current year
    YEAR=1991
    LAST_YEAR=$((YEAR-1))

    # previous year: create blacklist-cleaned file
    ./check_wikidata.py -b blacklist.tsv theof_${LAST_YEAR}.tsv wikidata_humans.tsv > theof_${LAST_YEAR}_wd_bl.tsv

    # last year: extend blacklist by all previous terms
    cp blacklist.tsv blacklist_lybl.tsv
    for iy in $(seq 1987 $LAST_YEAR); do
        awk -F'\t' '{print $3}' theof_${iy}_wd_bl.tsv | sort | uniq -c | sort -nr | \
            sed -e "s/^ *//" -e "s/ the /\t/" -e "s/ of$//" | awk -F'\t' '{print $2"\t"$1}' \
                                                                  >> blacklist_lybl.tsv
    done
    
    # now extract only new hits
    ./check_wikidata.py -b blacklist_lybl.tsv theof_${YEAR}.tsv wikidata_humans.tsv |\
        awk -F'\t' '{print $3}' | sort | uniq -c | sort -nr > bl.tsv
#+END_SRC

Now edit ~bl.tsv~ ... and then cleanup and append to existing file:
#+BEGIN_SRC sh :results raw
  sed -e "s/^ *//" -e "s/ the /\t/" -e "s/ of$//" bl.tsv | awk -F'\t' '{print $2"\t"$1}' >> blacklist.tsv
#  git commit blacklist.tsv

#+END_SRC

... and repeat for the next year

** most frequent sources

#+BEGIN_SRC sh
  awk -F'\t' '{print $3}' theof_*_wd_bl.tsv \
      | sed -e "s/^the //" -e "s/ of$//" \
      | sort | uniq -c | sort -nr | head -n20 
#+END_SRC

#+RESULTS:
| 74 | Michael      | Jordan      |
| 64 | Rodney       | Dangerfield |
| 47 | Madonna      |             |
| 37 | Babe         | Ruth        |
| 30 | Johnny       | Appleseed   |
| 26 | Mona         | Lisa        |
| 24 | Pearl        |             |
| 24 | Bill         | Gates       |
| 23 | Rembrandt    |             |
| 23 | Michelangelo |             |
| 22 | Donald       | Trump       |
| 22 | Dalai        | Lama        |
| 21 | Tiger        | Woods       |
| 21 | Jackie       | Robinson    |
| 21 | Cary         | Grant       |
| 19 | Tao          |             |
| 19 | John         | Wayne       |
| 18 | Napoleon     |             |
| 18 | Martha       | Stewart     |
| 18 | Boss         |             |

** format data for analysis

Put everything into a nice Markdown file:

#+BEGIN_SRC sh
  # echo $year
  ./tsv2md.py theof_1987_wdfiltered.tsv | head
#+END_SRC

#+RESULTS:
| - | [Bill](https://www.wikidata.org/wiki/Q3718763)     | (1987/01/01/0000063)                         |                      |
| - | [Prince](https://www.wikidata.org/wiki/Q7542)      | (1987/01/01/0000048)                         |                      |
| - | [Prince](https://www.wikidata.org/wiki/Q7542)      | (1987/01/01/0000048)                         |                      |
| - | [Hall](https://www.wikidata.org/wiki/Q16199353)    | (1987/01/01/0000069)                         |                      |
| - | [West](https://www.wikidata.org/wiki/Q7984198)     | (1987/01/01/0000070)                         |                      |
| - | [House](https://www.wikidata.org/wiki/Q25712978)   | (1987/01/01/0000175)                         |                      |
| - | [Dean](https://www.wikidata.org/wiki/Q24013760)    | (1987/01/01/0000180)                         |                      |
| - | [Freedom](https://www.wikidata.org/wiki/Q12312865) | (1987/01/01/0000201)                         |                      |
| - | [Anthony                                           | Quinn](https://www.wikidata.org/wiki/Q83484) | (1987/01/02/0000232) |
| - | [King](https://www.wikidata.org/wiki/Q16940470)    | (1987/01/02/0000249)                         |                      |
